------------------------------------------------------------------------------------------------------------------
-- By by Unknown Coder
------------------------------------------------------------------------------------------------------------------
local _, ns = ...              -- namespace
------------------------------------------------------------------------------------------------------------------
local GetTime = GetTime        -- Возвращает время работы системы в секундах с точностью до миллисекунды.
local timers = {}              -- одна переменная на все таймеры
------------------------------------------------------------------------------------------------------------------
function ns.TimerStarted(name) -- Проверяет запущен ли таймер
  return timers[name] ~= nil
end

------------------------------------------------------------------------------------------------------------------
function ns.TimerReset(name) -- Сбрасывает и удаляет таймер
  if ns.TimerStarted(name) then
    timers[name] = nil       -- чистим запись в таблице
  end
end

------------------------------------------------------------------------------------------------------------------
function ns.TimerStart(name, offset) -- Запуск/перезапуск таймера
  timers[name] = GetTime() + (offset or 0)
end

------------------------------------------------------------------------------------------------------------------
function ns.TimerElapsed(name) -- Возвращает прошедшее время в секундах с момента запуска таймера
  return GetTime() - (timers[name] or 0)
end

------------------------------------------------------------------------------------------------------------------
function ns.TimerLess(name, less) -- Возвращает true если с момента запуска таймера name прошло меннее less секунд
  return ns.TimerStarted(name) and ns.TimerElapsed(name) < (less or 0)
end

------------------------------------------------------------------------------------------------------------------
function ns.TimerMore(name, more) -- Возвращает true если с момента запуска таймера name прошло более more секунд или таймер не был запущен
  return ns.TimerElapsed(name) > (more or 0)
end

------------------------------------------------------------------------------------------------------------------
function ns.TimerToggle(name, toggle) -- Переключает состояние таймера (но не перезапускает, если уже запущен)
  if toggle then
    if not ns.TimerStarted(name) then ns.TimerStart(name) end
  else
    ns.TimerReset(name)
  end
end

------------------------------------------------------------------------------------------------------------------
