------------------------------------------------------------------------------------------------------------------
-- By by Unknown Coder
------------------------------------------------------------------------------------------------------------------
local _, ns = ... -- namespace
------------------------------------------------------------------------------------------------------------------
if ns.State.playerClass ~= 'DRUID' then return end
------------------------------------------------------------------------------------------------------------------
ns.Chat(ns.State.playerClass, ns.State.playerColor)
------------------------------------------------------------------------------------------------------------------
------------------------------------------------------------------------------------------------------------------
function ns:GetAction()
    if ns.State.playerCasting then -- возможно стоит перенести в ротацию (прерывание каста)
        return 'none', 'casting ' .. ns.State.playerCasting
    end

    if ns.State.playerHP100 < 40 then return 'Целительное прикосновение', 'heal' end
    if not ns.HasBuff('дикой природы') then return 'Знак дикой природы', 'buff' end
    if not ns.HasBuff('Шипы') then return 'Шипы', 'buff' end

    local tarcmd, tarinfo = ns.TryTarget()
    if tarcmd then
        return tarcmd, tarinfo
    end

    if not ns.HasMyDebuff('Лунный огонь') then
        return 'Лунный огонь', 'dots'
    end
    return 'Гнев', 'damage'

    --return 'none', 'ожидаем'
end

------------------------------------------------------------------------------------------------------------------
