------------------------------------------------------------------------------------------------------------------
-- By by Unknown Coder
------------------------------------------------------------------------------------------------------------------
local _, ns = ... -- namespace
------------------------------------------------------------------------------------------------------------------
if ns.State.playerClass ~= 'DRUID' then return end
------------------------------------------------------------------------------------------------------------------
ns.Chat(ns.State.playerClass, ns.State.playerColor)
------------------------------------------------------------------------------------------------------------------
------------------------------------------------------------------------------------------------------------------
function ns:GetAction()
    if ns.State.playerCasting then -- возможно стоит перенести в ротацию (прерывание каста)
        return 'none', 'занят, кастую ' .. ns.State.playerCasting
    end

    if ns.State.gcd then return 'none', 'гкд' end
    if ns.State.playerHP100 < 40 then return 'Целительное прикосновение', 'хилимся hp < 40%' end
    if not ns.HasBuff('дикой природы') then return 'Знак дикой природы', 'обмазываемся природой' end
    if not ns.HasBuff('Шипы') then return 'Шипы', 'распределяем колючки' end

    local tarcmd, tarinfo = ns.TryTarget()
    if tarcmd then
        return tarcmd, tarinfo
    end

    if not ns.HasMyDebuff('Лунный огонь') then
        return 'Лунный огонь', 'вешаем бяку'
    end
    return 'Гнев', 'кастим плюху'
end

------------------------------------------------------------------------------------------------------------------
